import telebot
from telebot import types


class MyTelegramBot:
    def __init__(self, token):
        self.bot = telebot.TeleBot(token)
        self.jobs = {
            "Менеджер": [""], "Комментатор": [""], "Спортивный юрист": [""],
            "Арбитр": [""], "Фитнес-тренер": [""], "Спортивный психолог": [""], 
            "Каппер": [""], "Учитель": [""], "Заместитель директора": [""], 
            "Методист": [""], "Библиотекарь": [""], "Секретарь": [""], 
            "Инженер-техник": [""], "Разработчик программного обеспечения": [""], 
            "Веб-разработчик": [""], "Разработчик игр": [""], "Аналитик данных": [""], 
            "Специалист по кибербезопасности": [""], "Системный администратор": [""], 
            "Живописец": [""], "Скульптор": [""], "Графический дизайнер": [""], 
            "Концепт-художник": [""], "Художник-постановщик": [""], "Музыкант-исполнитель": [""], 
            "Композитор": [""], "Дирижёр": [""], "Музыкальный педагог": [""], 
            "Музыкальный терапевт": [""], "Музыкальный менеджер": [""], 
            "Саунд-дизайнер": [""], "Эколог": [""], "Ландшафтный архитектор": [""], 
            "Экологический консультант": [""], "Экологический инженер": [""], 
            "Гидролог": [""], "Экологический юрист": [""], "Урбанист-эколог": [""], "Специалист по переработке": [""], 
            "Библиотекарь": [""], "Писатель": [""], "Редактор": [""], "Литературный агент": [""], 
            "Критик": [""], "Сотрудник книжного сайта": [""], "Работник издательства": [""], "Архитектурный визуализатор": [""], 
            "Инженер-конструктор": [""], "Специалист по дизайну": [""], "3D-моделлер": [""], "Инженер-проектировщик": [""], 
            "Картограф": [""], "Климатолог": [""], "Геомаркетолог": [""], "Менеджер по туризму": [""], "Инженер-геолог": [""], 
            "Моряк": [""], "Пилот": [""], "Авиационный техник": [""], "Логист": [""], "Машинист": [""], "Архитектор": [""],
            "Проектировщик": [""], "Инженер-строитель": [""], "Бетонщик": [""], "Энергетик": [""], "Прораб": [""], 
            "Ветеринар": [""], "Зоолог": [""], "Грумер": [""], "Дрессировщик": [""], "Селекционер": [""], 
            "Охраник природы": [""], "Ботаник": [""], "Фитопатолог": [""], "Агроном": [""], "Садовник": [""], 
            "Цветовод": [""], "Флорист": [""], "Адвокат": [""], "Прокурор": [""], "Нотариус": [""], "Следователь": [""], 
            "Судья": [""], "Преподаватель права": [""], "Арбитражный управляющий": [""], "Десантник": [""], "Снайпер": [""], 
            "Артиллерист": [""], "Разведчик": [""], "Военный врач": [""], "Танкист": [""], "Менеджер по маркетингу": [""],
            "Специалист по продвижению": [""], "Маркетинговый консультант": [""], "Контент-маркетолог": [""], "Рекламный дизайнер": [""], 
            "Маркетинговый аналитик": [""], "Философ": [""], "Научный сотрудник": [""], "Биоэтик": [""], "Коуч": [""], "Социолог": [""], 
            "Философский консультант": [""], "Шеф-повар": [""], "Кондитер": [""], "Пекарь": [""], "Менеджер ресторана": [""], 
            "Технолог пищевой промышленности": [""], "Повар-кондитер": [""], "Фуд-блогер": [""], "Гинеколог": [""], "Дерматолог": [""], 
            "Кардиолог": [""], "Офтальмолог": [""], "Онколог": [""], "Ортопед": [""], "Оториноларинголог": [""], "Педиатр": [""], "Психиатр": [""], 
            "Реаниматолог": [""], "Стоматолог": [""], "Терапевт": [""], "Травматолог": [""],
        }
        

