import telebot

class MyTelegramBot:
    def __init__(self, token):
        self.bot = telebot.TeleBot(token)
        self.jobs = ["Менеджер", "Комментатор", "Спортивный юрист", "Арбитр", "Фитнес-тренер", "Спортивный психолог", "Каппер", "Учитель", "Заместитель директора", "Методист", "Библиотекарь", "Секретарь", "Инженер-техник", "Разработчик программного обеспечения", "Веб-разработчик", "Разработчик игр", "Аналитик данных", "Специалист по кибербезопасности", "Системный администратор", "Живописец", "Скульптор", "Графический дизайнер", "Концепт-художник", "Художник-постановщик", "Музыкант-исполнитель", "Композитор", "Дирижёр", "Музыкальный педагог", "Музыкальный терапевт", "Музыкальный менеджер", "Саунд-дизайнер",
        "Эколог", "Ландшафтный архитектор", "Экологический консультант", "Экологический инженер", "Гидролог", "Экологический юрист", "Урбанист-эколог", "Специалист по переработке", "Библиотекарь", "Писатель", "Редактор", "Литературный агент", "Критик", "Сотрудник книжного сайта", "Работник издательства", "Архитектурный визуализатор", "Инженер-конструктор", "Специалист по дизайну", "3D-моделлер", "Инженер-проектировщик", "Картограф", "Климатолог", "Геомаркетолог", "Менеджер по туризму", "Инженер-геолог", "Моряк", "Пилот", "Авиационный техник", "Логист", "Машинист", "Архитектор",
        "Проектировщик", "Инженер-строитель", "Бетонщик", "Энергетик", "Прораб", "Ветеринар", "Зоолог", "Грумер", "Дрессировщик", "Селекционер", "Охраник природы", "Ботаник", "Фитопатолог", "Агроном", "Садовник", "Цветовод", "Флорист", "Адвокат", "Прокурор", "Нотариус", "Следователь", "Судья", "Преподаватель права", "Арбитражный управляющий", "Десантник", "Снайпер", "Артиллерист", "Разведчик", "Военный врач", "Танкист", "Менеджер по маркетингу",
        "Специалист по продвижению", "Маркетинговый консультант", "Контент-маркетолог", "Рекламный дизайнер", "Маркетинговый аналитик", "Философ", "Научный сотрудник", "Биоэтик", "Коуч", "Социолог", "Философский консультант", "Шеф-повар", "Кондитер", "Пекарь", "Менеджер ресторана", "Технолог пищевой промышленности", "Повар-кондитер", "Фуд-блогер", "Гинеколог", "Дерматолог", "Кардиолог", "Офтальмолог", "Онколог", "Ортопед", "Оториноларинголог", "Педиатр", "Психиатр", "Реаниматолог", "Стоматолог", "Терапевт", "Травматолог",
        "Уролог", "Фармацевт", "Венеролог", "Хирург", "Финансовый аналитик", "Аудитор", "Бухгалтер", "Финансовый консультант", "Риск-менеджер", "Финансовый директор", "Экономист", "Экономист-финансист"]
            # Можно добавить дополнительные профессии аналогично
        
        self.user_states = {}

        @self.bot.message_handler(commands=["game"])
        def game_bot(message):
            self.bot.send_message(message.chat.id, "🧑‍💻 Введите название профессии, с которой хотите начать интересный квиз!\n\n "
"Соблюдайте пожалуйтса пунктуацию❗️")
            def prompt(message):
                prompt = message.text
                chat_id = message.chat.id
                
                


    def start_polling(self):
        print("Бот запущен...")
        self.bot.polling(none_stop=True)

if __name__ == "__main__":
    TOKEN = 'YOUR_BOT_TOKEN'
    my_bot = MyTelegramBot(TOKEN)
    my_bot.start_polling()